// {
//   "book": "",
//   "author": "",
//   "about": "",
//   "facts": ['', ''],
//   "movies": ["", "", ""],
//   "movie_links": ["", "", ""],
//   "cites": ["", "", "", ""]
// },

let line1 = [
  {
    "book": "Братья Карамазовы",
    "author": "Федор Михайлович Достоевский",
    "about": "Роман представляет собой философское произведение, затрагивающее вопросы о Боге, свободе воли и морали.",
    "facts": ['«Братья Карамазовы» — заключительный роман так называемого «великого пятикнижия Достоевского». В него также входят романы «Преступление и наказание», «Идиот», «Подросток» и «Бесы».', '"Братья Карамазовы" - последний роман Ф.М.Достоевского. Писатель умер через два месяца после публикации.'],
    "movies": ["Братья Карамазовы (фильм, СССР, 1968)", "Мальчики (фильм, СССР, 1990)", "Братья Карамазовы (сериал, Россия, 2009)"],
    "movie_links": ["https://www.kinopoisk.ru/film/46217/", "https://www.kinopoisk.ru/film/421334/", "https://www.kinopoisk.ru/series/322063/"],
    "cites": ["Будем, во-первых, и прежде всего добры, потом честны, а потом — не будем  никогда забывать друг о друге.", "Господь не в силе, а в правде.", "Главное, самому себе не лгите. Лгущий самому себе и собственною ложь свою слушающий до того доходит, что уж никакой правды ни в себе, ни кругом не различает, а стало быть, входит в неуважение и к себе, и к другим.", "... тайна человеческого бытия не в том, чтобы только жить, а в том, для чего жить.", "Вы, сударь, не презирайте меня: в России пьяные люди у нас самые добрые. Самые добрые люди у нас и самые пьяные."]
  },
  {
    "book": "Окаянные дни",
    "author": "Иван Алексеевич Бунин",
    "about": "Художественное и философско-публицистическое произведение, которое отражает эпоху революции и последовавшей за ней гражданской войны.",
    "facts": ['Основу произведения составляет документирование и осмысление Буниным разворачивавшихся в Москве 1918 года и в Одессе 1919 года революционных событий, свидетелем которых он стал.', 'Произведение отражает переломный этап как в жизни, так и в творческой биографии писателя.', '"Окаянные дни" были запрещены в СССР и не публиковались вплоть до Перестройки.'],
    "movies": ["Солнечный удар (фильм, Россия, 2014)"],
    "movie_links": ["https://www.kinopoisk.ru/film/586308/"],
    "cites": ["Если человек не потерял способности ждать счастья — он счастлив. Это и есть счастье.", "Какая это старая русская болезнь, это томление, эта скука, эта разбалованность — вечная надежда, что придет какая-то лягушка с волшебным кольцом и все за тебя сделает: стоит только выйти на крылечко и перекинуть с руки на руку колечко.", "Народ сам сказал про себя: «из нас, как из древа, – и дубина, и икона», – в зависимости от обстоятельств, от того, кто это древо обрабатывает: Сергий Радонежский или Емелька Пугачев.", "Все это повторяется потому прежде всего, что одна из самых отличительных черт революций – бешеная жажда игры, лицедейства, позы, балагана. В человеке просыпается обезьяна."]
  },
  {
    "book": "Как закалялась сталь",
    "author": "Николай Алексеевич Островский",
    "about": "Роман повествует о судьбе молодого революционера Павла Корчагина, отстаивающего завоевания Советской власти в Гражданской войне.",
    "facts": ["Книга обрела большую популярность в Китае, а также в Японии.", "Второстепенный персонаж по имени Павел Корчагин присутствует в повести «Школа» Аркадия Гайдара, написанной несколькими годами ранее."],
    "movies": ["Как закалялась сталь (фильм, СССР, 1942)", "Павел Корчагин (фильм, СССР, 1956)", "Как закалялась сталь (мини–сериал, СССР, 1973)"],
    "movie_links": ["https://www.kinopoisk.ru/film/44686/", "https://www.kinopoisk.ru/film/42907/", "https://www.kinopoisk.ru/series/369682/"],
    "cites": ["Катись колбаской по Малой Спасской! Скажи деду – в Москву еду!", "Вот как иногда поворачивается жизнь: то темь беспросветная, то снова улыбается солнце.", "Умей жить и тогда, когда жизнь становится невыносимой. Сделай ее полезной.", "Самое дорогое у человека – это жизнь. Она дается ему один раз, и прожить ее надо так, чтобы не было мучительно больно за бесцельно прожитые годы."]
  },
  {
    "book": "Молодая гвардия",
    "author": "Александр Александрович Фадеев",
    "about": "Роман посвящён действовавшей в Краснодоне во время Великой Отечественной войны молодёжной подпольной организации под названием «Молодая гвардия» (1942—1943).",
    "facts": ['Роман «Молодая гвардия» был вторым по издаваемости произведением детской литературы в СССР за 1918—1986 годы: общий тираж 276 изданий составил 26,143 млн экземпляров.', 'Идею своей книги Фадеев взял из книги В. Г. Лясковского и М. Котова «Сердца смелых», изданной в 1944 году.'],
    "movies": ["Молодая гвардия (фильм, СССР, 1948)", "Последняя исповедь (мини–сериал, Россия, 2006)", "Молодая гвардия (сериал, Россия, 2015)"],
    "movie_links": ["https://www.kinopoisk.ru/film/46682/", "https://www.kinopoisk.ru/series/436295/", "https://www.kinopoisk.ru/series/880743/"],
    "cites": ["А что! Нашего народа не сломит никто! ...Да разве есть другой такой народ на свете? У кого душа такая хорошая?", "Дай же Бог счастья нашим людям, шо останутся после нас на земли! – тихо, торжественно сказал Валько", "Дружба! Сколько людей на свете произносят это слово, подразумевая под ним приятную беседу за бутылкой вина и снисхождение к слабостям друг друга!", "Всегда… везде… Не бойся… будь сильный… орлик мой… до последнего дыхания…"]
  },
  {
    "book": "В окопах Сталинграда",
    "author": "Виктор Платонович Некрасов",
    "about": "Описываемые в повести события охватывают период военных действий с июля 1942 года по февраль 1943 года, когда под натиском немцев части Красной Армии, создавая и оставляя оборонительные рубежи в районе Харькова и реки Оскол, отступали за Дон, чтобы закрепиться и сражаться в районе Сталинграда.",
    "facts": ['Повесть была удостоена Сталинской премии (1947).', 'Повесть неоднократно переиздавалась большими тиражами, но после лишения автора советского гражданства была изъята из публичных библиотек.'],
    "movies": ["Солдаты (фильм, CCCР, 1956)"],
    "movie_links": ["https://www.kinopoisk.ru/film/43901/"],
    "cites": ["Жили, учились, о чем-то мечтали – тр-рах! – все полетело – дом, семья, институт, сопроматы, история архитектуры, Парфенон.", "Есть детали, которые запоминаются на всю жизнь. И не только запоминаются. Маленькие, как будто незначительные, они въедаются, впитываются как-то в тебя, начинают прорастать, вырастают во что-то большое, значительное, вбирают в себя всю сущность происходящего, становятся как бы символом. Я помню одного убитого бойца. Он лежал на спине, раскинув руки, и к губе его прилип окурок. Маленький, еще дымившийся окурок. И это было страшней всего, что я видел до и после на войне. Страшнее разрушенных городов, распоротых животов, оторванных рук и ног. Раскинутые руки и окурок на губе. Минуту назад была еще жизнь, мысли, желания. Сейчас – смерть."]
  },
  {
    "book": "Один день Ивана Денисовича",
    "author": "Александр Исаевич Солженицын",
    "about": "В повести рассказывается об одном дне из жизни советского заключённого, русского крестьянина и солдата Ивана Денисовича Шухова",
    "facts": ['Первоначальное авторское название — «Щ-854. Один день одного зэка»', 'Повесть была начата 18 мая 1959 г. и закончен 30 июня. Работа заняла меньше полутора месяцев.'],
    "movies": ["Один день Ивана Денисовича (фильм, Норвегия, 1970)"],
    "movie_links": ["https://www.kinopoisk.ru/film/112841/"],
    "cites": ["У тех людей всегда лица хороши, кто в ладах с совестью своей.", "Работа – она как палка, конца в ней два: для людей делаешь – качество дай, для начальника делаешь – дай показуху.", "Тёплый зяблого разве когда поймёт?", "Брюхо – злодей, старого добра не помнит, завтра опять спросит.", "Незнайка на печи лежит, а знайку на верёвочке ведут…", "Лёгкие деньги – они и не весят ничего, и чутья такого нет, что вот, мол, ты заработал."]
  },
  {
    "book": "Зеленый шатер",
    "author": "Людмила Евгеньевна Улицкая",
    "about": "Роман в 30 рассказах, посвящённый зарождению инакомыслия в советском обществе и поколению шестидесятников-диссидентов.",
    "facts": ['Жанр «Зелёного шатра» иногда определяется как публицистическая беллетристика: «это не роман, не историческое исследование и не публицистическая статья, а нечто среднее»', 'Роман переведён на основные европейские языки.'],
    "movies": ["В 2012 г. Анджей Бубень поставил в петербургском театре «Балтийский дом» спектакль по роману Улицкой"],
    "movie_links": [],
    "cites": ["Интересно проследить траекторию движения, приводящего к неминуемой встрече предназначенных друг другу людей.", "Учитесь, у образованных людей жизнь интересней, чем у неучей.", "Нельзя стоять на чем-то одном. Табурет и тот на четырех ногах!", "Непостижимый, странный закон: к чувству собственной вины склонны всегда самые невинные.", "Война – самая большая мерзость из тех, что выдумали люди"]
  }
];
bookCards(line1);

// Modal
const modalCall = $("[data-modal]");
const modalClose = $("[data-close]");

modalCall.on("click", function (event) {
  event.preventDefault();



  let $this = $(this);
  let modalId = $this.data("modal");

  console.log(modalId);




  $(modalId).addClass("show");
  $("body").addClass("no-scroll");

  // setTimeout(function() {
  //     $(modalId).find(".modal__dialog").css({
  //         transform: "rotateX(0)"
  //     });
  // }, 200);

  $('#sliderLine1').slick('setPosition');

});

modalClose.on("click", function (event) {
  event.preventDefault();

  let $this = $(this);
  let modalParent = $this.parents(".modal");

  modalParent.removeClass("show");
  $("body").removeClass("no-scroll");
});

$(".modal").on("click", function (event) {
  $(this).removeClass("show");
  $("body").removeClass("no-scroll");
});

$(".modal__dialog").on("click", function (event) {
  event.stopPropagation();
});


// Slider: https://kenwheeler.github.io/slick/
$('#sliderLine1').slick({
  infinite: true,
  slidesToShow: 1,
  slidesToScroll: 1,
  fade: true,
  arrows: false,
  dots: true,
});

$('.slickPrev').on('click', function (event) {
  event.preventDefault();

  $('#sliderLine1').slick('slickPrev');
});

$('.slickNext').on('click', function (event) {
  event.preventDefault();

  $('#sliderLine1').slick('slickNext');
});




function bookCards(line1) {



  let str = '';
  // let bookCards = [];

  line1.forEach(b => {
    let str_temp = '';
    let facts = '';
    b.facts.forEach(fact => {
      facts += "<p>" + fact + '</p>';
    });

    let movies = '';
    if (b.movie_links.length == 0) {
      movies += '<div class="modal__h2">Адаптации:</div>' + '<p>' + b.movies[0] + '</p>';
    } else {
      movies += '<div class="modal__h2">Экранизации:</div>'

      for (let i = 0; i < b.movies.length; i++) {
        movies += '<div class="modal__films">' +
          '<span class="modal__icon"><img src="./assets/img/cards/clapperboard.png" alt="clapperboard-icon"></span>' +
          '<a class="modal__film" href="' +
          b.movie_links[i] +
          '"target="blank">' +
          b.movies[i] +
          '</a>' +
          '</div>';
      }
    }

    let cites = '';
    b.cites.forEach((cite, i) => {
      if (i == 0) {
        cites += '<div class="modal__par">' +
          '<div class="modal__h2">Цитаты из книги:</div>' +
          cite +
          '</div>';
      } else {
        cites += '<div class="modal__par">' + cite + '</div>';
      }
    });
    str_temp +=
      '<div class="modal__card">' +
      '<div>' +
      '<div class="modal__title">' +
      '<div class="modal__text">' +
      '<span class="modal__book">' +
      b.book +
      '</span>' +
      '<span class="modal__author">' + b.author + '</span>' +
      '</div>' +
      '</div>' +
      '<div class="modal__content">' +
      '<div class="modal__left">' +
      '<div class="modal__par">' +
      '<div class="modal__h2">О книге:</div>' +
      b.about +
      '</div>' +
      '<div class="modal__par">' +
      '<div class="modal__h2">Факты:</div>' +
      facts +
      '</div>' +
      '<div class="modal__par">' +
      movies +
      '</div>' +
      '</div>' +
      '<div class="modal__right">' +
      cites +
      '</div>' +
      '</div>' +
      '<div class="modal__footer">' +
      '<div class="modal__line">' +
      '<svg class="modal__line-num-left" width=20 height=20>' +
      '<rect x="0" y="0" width="20" height="20" fill="#6F75AE" rx="4"></rect>' +
      '<text class="text_num text_num--modal" x="6" y="14">' + '1' + '</text>' +
      '</svg>' +
      '<svg class="modal__line-num-right" width=20 height=20>' +
      '<rect x="0" y="0" width="20" height="20" fill="#6F75AE" rx="4"></rect>' +
      '<text class="text_num text_num--modal" x="6" y="14">' + '1' + '</text>' +
      '</svg>' +
      '</div>' +
      '</div>' +
      '</div>' +
      '</div>';

    // bookCards.push(str_temp);
    str += str_temp;
    str_temp = '';

  });
  let l1 = document.getElementById("sliderLine1");
  l1.insertAdjacentHTML('afterbegin', str);
}


// $.getJSON( "./js/line1.json", function( data ) {
//   console.log(data);
// });


// let final = '';
// inhtml.forEach(book => {
//   final += book;
// });

// let l1 = document.getElementById("sliderLine1");
// console.log(l1);
// l1.insertAdjacentHTML('afterbegin', final);